text = input()


CUSTOM_CODE_DICT = {'А':'01','Б':'00','В':'7','Г':'85','Д':'42','Е':'35','Ж':'75','И':'4','Й':'5','К':'11','Л':'111','М':'1111','Н':'0000',
                   'У':'0','Ц':'00','Ш':'30','Щ':'03','З':'4544','Х':'476','Ъ':'1564','Ф':'654','Ы':'*94','П':'/7412','Р':'*854','О':'*85','Э':'*45',
                   'Я':'78564999','Ч':'-9','С':'-1','Т':'-5','Ь':'-2','Ю':'-3','а':'*q-','б':'-**f*','в':'*ds--','г':'-fb-*','д':'-*dg*','е':'*qe','ж':'**vdz*-',
                   'з':'--vxa**','и':'*f*','й':'*-ggg--','к':'-bd*-','л':'*-da**','м':'-qef-','н':'-s*','о':'ger','п':'*-wfff-*','р':'*-ds*','с':'*vc**','т':'v-','у':'*bx*-',
                   'ф':'**-qe*','х':'**fdsfqe**','ц':'-344*-*','ч':'-bvzr--*','ш':'---dgsh-','щ':'-dgwr-*-','ъ':'--dgdh*--','ы':'-*t3-4-','ь':'-*555*-','э':'**321-**','ю':'**445--',
                   'я':'*-*-',' ':'_','.':'0g',',':'7f','?':'4f',':':'66','1': '.--4324--', '2': '..--13-', '3': '...-234-', '4': '...wer.-', 
                   '5': '.2222222....', '6': '-133....', '7': '-00313-...', '8': '---1313..', '9': '-0010101010---.', 
                   '0': '--43413213---','A': '.fg-', 'B': '-.qew..', 'C': '-eqe.-.', 'D': '-rt..', 'E': 'tg.', 
                   'F': '..gvsf-.', 'G': '-113fz23-.', 'H': '..ewfv123..', 'I': '.f.', 'J': 'r.---', 
                   'K': '-ewf.-', 'L': '.-.sf52.', 'M': '-sf56qwe-', 'N': '-4sf65s.', 'O': '-4198qe--', 
                   'P': './fsffsf--.', 'Q': '////--.-', 'R': '.-q/.', 'S': './/qe..', 'T': '*****-', 
                   'U': '..956z-', 'V': '..66qr4.-', 'W': '.--56sf+', 'X': '-..+F5sF-', 'Y': '-qeqwrf+.--', 
                   'Z': '--+sfcsdfq..', 'a': '+s45f.-', 'b': '-949+56ad...', 'c': '-.-4+4.', 'd': '-.qfzvqe++65.', 
                   'e': '.94qdd1c', 'f': '..-werf+sf.', 'g': '-sfsd+f5+r-.', 'h': '.qdc+7+e...', 'i': '.qe45+d2adqeddad.', 
                   'j': '.-++==--', 'k': '-sfs49qe3dfd.-', 'l': '.-dfqdf..', 'm': '-sdfqedzdad-', 'n': '-fsf+45', 
                   'o': '--re+==-', 'p': '.--===.', 'q': '-=====-.-', 'r': '595=.-.', 's': '..=4+5=.', 
                   't': '-s9df--*/', 'u': '.===dsf.-', 'v': '4998==...-', 'w': '.-666=1-', 'x': '4sdf==-..-', 
                   'y': '-.sdfsdf-e-', 'z': '-eeefvvce-..'}



        
def encrypt(text):
    crypt = []
    for i in text:
        if i in CUSTOM_CODE_DICT:
            crypt.append(CUSTOM_CODE_DICT[i])
    return ' '.join(crypt)

def decrypt(crypt):
    message = []
    codes = crypt.split(' ')
    for code in codes:
        for key, value in CUSTOM_CODE_DICT.items():
            if value == code:
                message.append(key)
    return ''.join(message)

encrypted_text = encrypt(text)
print(encrypted_text)

decrypted_text = decrypt(encrypted_text)
print(decrypted_text)